/*************************************************************************
    > File Name: try.cpp
    > Title: 
    > Description: 
    > Created Time: 2014年04月19日 星期六 15时55分42秒
 ************************************************************************/

#include<iostream>
using namespace std;

//运算符优先级：赋值
//(++a)+=a++	(++a)+=(a++)
//赋值自右向左运算
//9,10,11

int main()
{
	int a=4;
	a+=(a++);
	cout<<a<<endl;

	a=4;
	a+=(++a);
	cout<<a<<endl;

	a=4;
	(++a)+=a++;
	cout<<a<<endl;

	//a++不能作左值
//	(a++)+=a++;
}
